Repository: mohamedati/Vristo
Catalog: Resources/IdentityMessages.*.resx
Languages: ar

# DefaultError
source: An unknown error occurred.
ar: حدث خطأ غير معروف.

# ConcurrencyFailure
source: Optimistic concurrency failure, object modified.
ar: فشل في التزامن، تم تعديل الكائن.

# PasswordMismatch
source: Incorrect password.
ar: كلمة المرور غير صحيحة.

source: Invalid token.
ar: رمز التحقق غير صالح.

# LoginAlreadyAssociated
source: A user with this login already exists.
ar: يوجد مستخدم مرتبط بمعلومات الدخول هذه بالفعل.

# InvalidUserName
source: Username '{0}' is invalid.
ar: اسم المستخدم '{0}' غير صالح.

# InvalidEmail
source: Email '{0}' is invalid.
ar: البريد الإلكتروني '{0}' غير صالح.

# DuplicateUserName
source: Username '{0}' is already taken.
ar: اسم المستخدم '{0}' مستخدم بالفعل.

# DuplicateEmail
source: Email '{0}' is already taken.
ar: البريد الإلكتروني '{0}' مستخدم بالفعل.

# InvalidRoleName
source: Role name '{0}' is invalid.
ar: اسم الدور '{0}' غير صالح.

# DuplicateRoleName
source: Role name '{0}' is already taken.
ar: اسم الدور '{0}' مستخدم بالفعل.

# UserAlreadyHasPassword
source: User already has a password.
ar: المستخدم لديه كلمة مرور بالفعل.

# UserLockoutNotEnabled
source: Lockout is not enabled for this user.
ar: تأمين الحساب غير مفعل لهذا المستخدم.

# UserAlreadyInRole
source: User already in role '{0}'.
ar: المستخدم بالفعل في الدور '{0}'.

# UserNotInRole
source: User is not in role '{0}'.
ar: المستخدم ليس في الدور '{0}'.

# PasswordTooShort
source: Password must be at least {0} characters.
ar: كلمة المرور يجب أن تكون على الأقل {0} حروف.

# PasswordRequiresNonAlphanumeric
source: Password must contain a special character.
ar: كلمة المرور يجب أن تحتوي على رمز خاص.

# PasswordRequiresDigit
source: Password must contain at least one digit.
ar: كلمة المرور يجب أن تحتوي على رقم واحد على الأقل.

# PasswordRequiresLower
source: Password must contain at least one lowercase.
ar: كلمة المرور يجب أن تحتوي على حرف صغير واحد على الأقل.

# PasswordRequiresUpper
source: Password must contain at least one uppercase.
ar: كلمة المرور يجب أن تحتوي على حرف كبير واحد على الأقل.

# PasswordRequiresUniqueChars
source: Password must contain at least {0} unique characters.
ar: كلمة المرور يجب أن تحتوي على {0} حرفًا فريدًا على الأقل.
